docs/physics/climate/gcm.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>General Circulation Model</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">General Circulation Model</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-6aece749-c320-4df5-aed5-1896af050400">1. Overview</a></li>
<li><a href="#h-82a5d119-db84-4d64-8282-ff5c57d5e446">2. Primitive Equations</a></li>
<li><a href="#h-3bd2952b-be5e-499e-abfe-d3a46a41e9b7">3. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-6aece749-c320-4df5-aed5-1896af050400" class="outline-2">
<h2 id="h-6aece749-c320-4df5-aed5-1896af050400"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-h-6aece749-c320-4df5-aed5-1896af050400">
<p>
Broadly speaking, "the" general circulation model for the atmosphere is
"just" a "shallow" <a href="../fluid-mechanics/navier-stokes.html">Navier-Stokes fluid</a> around a rotating sphere,
relative to an observe on the sphere.
</p>

<p>
Typically the viscousity is neglected (since its contribution is on the
order of \(10^{-7}\) compared to dominant effects), so we could extend the
notion of a general circulation model to include Euler fluids around a
rotating sphere, relative to an observer on the spehere. At least, John
Holton describes the negligibility of viscosity in his book
<cite class="book-title">An Introduction to Dynamic Meteorology</cite>; it's not the
defining quality of the atmosphere, anyways.
</p>

<div class="danger" id="orgc00fba5">
<p>
Most general circulation models work in spherical coordinates, so extra
care must be taken. For example, the vector Laplacian is defined by the
identity \(\nabla^{2}\mathbf{v} = \vec{\nabla}(\nabla\cdot\mathbf{v})-\nabla\times(\nabla\times\mathbf{v})\)
and not just the sum of squares of partial derivatives.
</p>

</div>

<div class="remark" id="org3870abc">
<p>
The notation for <a href="https://en.wikipedia.org/wiki/Spherical_coordinate_system">spherical coordinates</a> in Earth Sciences appears to be
&#x2014; <b>when expressed in radians!</b> &#x2014;
the \(\lambda\in[-\pi,\pi)\) is used for longitude measuring the "azimuthal" angle
East-West, latitude \(\phi\in[-\pi/2,\pi/2]\) measuring the "polar" angle
North-South with the equator being located at \(\phi_{\text{eq}}=0\). This
needs some correction to account for the Earth being a little "short and
fat" rather than a perfect sphere, but it's a good approximation. 
</p>

</div>

<div class="proposition" id="orgc0c1885">
<p>
We change coordinates to spherical coordinates, taking \(\lambda\) to
describe the longitude (Eastwards angle), \(\phi\) the latitude (angular
distance polewards), and \(r\) the radial distance from the center of the
Earth. In these coordinates, any scalar quantity \(Q\) has its
material derivative be
</p>
\begin{equation}
  \frac{\mathrm{D}Q}{\mathrm{D} t}
  = \frac{\partial Q}{\partial t}
    + \frac{u}{r\cos(\phi)}\frac{\partial Q}{\partial\lambda}
    + \frac{v}{r}\frac{\partial Q}{\partial\phi}
    + w\frac{\partial Q}{\partial r}.
\end{equation}

</div>

<div class="theorem" id="org80fa6b8">
<p>
Mass conservation in spherical coordinates is
</p>
\begin{equation}
  \frac{\partial\rho}{\partial t}
  + \frac{1}{r\cos(\phi)}\frac{\partial(u\rho)}{\partial\lambda}
  + \frac{1}{r\cos(\phi)}\frac{\partial}{\partial\phi}(v\rho\cos(\phi))
  + \frac{1}{r^{2}}\frac{\partial}{\partial r}(r^{2}w\rho)
  = 0
\end{equation}
<p>
where we have \(\lambda\) be the latitude coordinate, \(\phi\) the
longitude coordinate, \(r\) the vertical/radial coordinate; and
\(\vec{u}=(u,v,w)\) is the velocity pointing North \(u\), East \(v\), and
outward \(w\).
</p>

</div>

<div class="theorem" id="org59e041b">
<p>
Momentum conservation in a rotating frame using spherical coordinates
are (neglecting the viscosity term)
</p>
\begin{equation}
\frac{\mathrm{D} u}{\mathrm{D} t} -\left(2\Omega + \frac{u}{r\cos(\phi)}\right)(v\sin(\phi)-w\cos(\phi))
= \frac{-1}{\rho r\cos(\phi)}\frac{\partial p}{\partial\lambda}
\end{equation}
\begin{equation}
\frac{\mathrm{D} v}{\mathrm{D} t} -\left(2\Omega + \frac{u}{r\cos(\phi)}\right)u\sin(\phi)
= \frac{-1}{\rho r}\frac{\partial p}{\partial\phi}
\end{equation}
\begin{equation}
\frac{\mathrm{D} w}{\mathrm{D} t} - \frac{u^{2}+v^{2}}{r} -
  2\Omega u\cos(\phi)
= \frac{-1}{\rho}\frac{\partial p}{\partial r}-g.
\end{equation}
<p>
Here \(g\approx 9.8 \mathrm{m}/\mathrm{s}^{2}\) is the Earth's
gravitational force (treated as a constant).
The quadratic terms on the left-hand side involving factors of \(1/r\)
are usually called <dfn>metric terms</dfn>, and those involving factors of
\(\Omega\) are <dfn>Coriolis terms</dfn>. Empirically, the Earth's
rotation is approximately
</p>
\begin{equation}
\Omega=7.2921150\times10^{-5}\,\mathrm{rad}\cdot\mathrm{s}^{-1}.
\end{equation}

</div>

<div class="remark" id="orgd3d20c5">
<p>
The "full blown" GCM equations are first-order quasilinear partial
differential equations. They are under-determined, since we have now 4
equations for 5 unknowns (the 3 velocity components, the pressure, and
the density). We need one more equation, and some initial conditions, to
have a unique solution. 
</p>

</div>

<div class="puzzle" id="org382380f">
<p>
(1) What extra equation can we add to this system?
</p>

<p>
(2) Can we solve these equations exactly?
</p>

<p>
(3) If we pretend the material derivative \(\mathrm{D}/\mathrm{D} t\) are
just partial derivatives with respect to time \(\partial/\partial t\),
then what are the solutions to <i>that</i> system of PDEs?
</p>

</div>

<p>
Presumably <i>one</i> family of boundary conditions we could impose would use
the fact that at "the top" of the atmosphere, we expect:
</p>
<ul class="org-ul">
<li>the <a href="solar-constant.html">Solar constant</a> or <a href="effective-temperature.html">effective temperature</a> of the Earth would be used
if we use the ideal gas Law,</li>
<li>the density of the atmosphere \(\rho(R)=0\),</li>
<li>and so on.</li>
</ul>
</div>
</div>

<div id="outline-container-h-82a5d119-db84-4d64-8282-ff5c57d5e446" class="outline-2">
<h2 id="h-82a5d119-db84-4d64-8282-ff5c57d5e446"><span class="section-number-2">2.</span> Primitive Equations</h2>
<div class="outline-text-2" id="text-h-82a5d119-db84-4d64-8282-ff5c57d5e446">
<p>
There are three simplifications to the equations, the first two of them
come as a package-deal (i.e., must be taken together or not at all):
</p>

<ol class="org-ol">
<li><b>Shallow fluid:</b> \(r=a+z\) where \(a\) is the radius of the Earth and \(z\)
is the altitude. In this approximation, \(z\ll a\), so \(1/(a+z)=
   a^{-1}/(1+z/a)=a^{-1} - a^{-2}z+\dots\approx a^{-1}\).
Partial derivatives with respect to \(r\) are then taken with
respect to \(z\);</li>
<li><b>Hydrostatic approximation:</b> the radial component of the Navier-Stokes
equation may be approximated as \(\partial_{z}p=\rho g\); and</li>
<li><b>Traditional approximation:</b> we can discard the Coriolis terms in the
horizontal equations of motion, as well as terms \(uw/r\) and \(vw/r\)
since they are negligibly small.</li>
</ol>

<div class="theorem" id="org7b4a4fd">
<p>
Taken altogether, the Navier-Stokes equations &#x2014; with \(u\) being the
atmospheric fluid's velocity North-wards, \(v\) is the East-wards
component, and \(w\) is the altitude "outward" component &#x2014; simplifies to:
</p>

\begin{equation}
\frac{\mathrm{D} u}{\mathrm{D} t}
- 2\Omega v\sin(\phi) - \frac{uv}{a}\tan(\phi)
= \frac{-1}{\rho a\cos(\phi)}\frac{\partial p}{\partial\lambda}
\end{equation}
\begin{equation}
\frac{\mathrm{D} v}{\mathrm{D} t}
 - 2\Omega u\sin(\phi) - \frac{u^{2}\tan(\phi)}{a}
= \frac{-1}{\rho a}\frac{\partial p}{\partial\phi}
\end{equation}
\begin{equation}
0 = \frac{-1}{\rho}\frac{\partial p}{\partial z}-g.
\end{equation}

<p>
In this approximation, the material derivative is
</p>
\begin{equation}
  \frac{\mathrm{D}}{\mathrm{D} t}=\frac{\partial}{\partial t} +
  \frac{u}{a\cos(\phi)}\frac{\partial}{\partial\lambda} +
  \frac{v}{a}\frac{\partial}{\partial\phi} + w\frac{\partial}{\partial z}.
\end{equation}

</div>

<div class="remark" id="orgd4f50df">
<p>
We have 3 first-order partial differential equations in 5 unknowns (the
3 components of the atmospheric fluid velocity, the pressure, and the
denity). We need 2 more equations and initial conditions to have a
unique solution. At first, it may be tempting to use the ideal gas Law
for an additional constraint &#x2014; after all, the atmosphere is remarkably
close to an ideal gas. But then we introduce another unknown, the
temperature.
</p>

<p>
The ideal gas Law relevant for the atmosphere would be \(p=\rho RT\) where
\(R = 287\; \mathrm{J}\cdot\mathrm{kg}^{-1}\cdot\mathrm{K}^{-1}\) is the gas
constant for dry air, and \(T\) is the atmosphere's temperature (another
unknown scalar function which we need to fix by means of another equation).
</p>

</div>

<div class="puzzle" id="org55e63dd">
<p>
Is there an exact solution to the primitive equations? It seems like, if
we work in the Lagrange description, there should be a unique solution
we could find fairly easily?
</p>

</div>

<div class="theorem" id="orga2e87e3">
<p>
The mass conservation equation for a shallow atmosphere becomes
</p>
\begin{equation}
  \frac{\partial\rho}{\partial t}
  + \frac{u}{a\cos(\phi)}\frac{\partial\rho}{\partial\lambda}
  + \frac{v}{a}\frac{\partial\rho}{\partial\phi}
  + w\frac{\partial\rho}{\partial z}
  + \rho\left(\frac{1}{a\cos(\phi)}\frac{\partial u}{\partial\lambda}
              + \frac{1}{a\cos(\phi)}\frac{\partial(v\cos(\phi))}{\partial\phi}
              + \frac{\partial w}{\partial z}
       \right)
  = 0
\end{equation}
<p>
or equivalently
</p>
\begin{equation}
  \frac{\partial\rho}{\partial t}
  + \frac{1}{a\cos(\phi)}\frac{\partial(u\rho)}{\partial\lambda}
  + \frac{1}{a\cos(\phi)}\frac{\partial(v\rho\cos(\phi))}{\partial\phi}
  + \frac{\partial(w\rho)}{\partial z}
  = 0.
\end{equation}

</div>

<div class="puzzle" id="org373d2bf">
<p>
What is the rigorous "limiting process" relating the solutions of the
full GCM equations to the solutions to the primitive equations? I sense
there is some difficult discontinuity here, but it is not at all
"immediately obvious" at the moment&#x2026;
</p>

</div>
</div>
</div>

<div id="outline-container-h-3bd2952b-be5e-499e-abfe-d3a46a41e9b7" class="outline-2">
<h2 id="h-3bd2952b-be5e-499e-abfe-d3a46a41e9b7"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-h-3bd2952b-be5e-499e-abfe-d3a46a41e9b7">
<ul class="org-ul">
<li>James R. Holton and Gregory J. Hakim,<br>
<cite class="book-title">An Introduction to Dynamic Meteorology</cite>.<br>
Academic Press, 5th ed., 2012.</li>
<li>G. K. Vallis,<br>
<cite class="book-title">Atmospheric and Oceanic Fluid Dynamics: Fundamentals and Large-Scale Circulation</cite>.<br>
Cambridge University Press, 2 ed., 2017.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-04-11 Mon 12:05.</p>
</div>
</body>
</html>